// C++ 에서 알아야 하는 것

// 1. C 에도 있지만 C++에서 더욱 발전된 개념들 
//    ==> 함수(템플릿, 오버로딩등), 변수(auto등), 제어문 ==> 1일차(월요일)

// 2. 클래스 문법 : 하나의 클래스를 만들때 필요한 문법 - "stack" 예제 참고
//    ==> 생성자, private, static 멤버 데이타(함수), this, const 멤버 함수..
//        초기화 리스트.
//    "linked list", "stack" 같은 한개의 도구(타입)을 만들때 필요
//    
//	   결국, 코딩은 C 스타일로 계속 하면서, 필요한 도구(stack등) 정도만 활용하는 단계

// 3. 상속 문법 : upcasting, 가상함수, 추상 클래스, 인터페이스등..
//    ==> 핵심 : 왜 이런 문법이 필요하고, 어떻게 활용해야 하는가 ?
//               약한 결합의 장점, OCP 개념, 다형성이 좋은점..
//    ================> "디자인 패턴 분야"

// 4. C++ 기타 문법들 : 에러 처리를 위한 예외, 연산자 재정의등

// 5. 표준 라이브러리(STL) 사용법  


